[{"item":"How to find:"},{"item":"“Ctrl + F”"},{"item":"Questions Bank"},{"item":"NOTE: If you have the new question on this test, please comment Question and Multiple-Choice list in form below this article. We will update answers for you in the shortest time. Thank you! We truly value your contribution to the website."},{"item":"1. Which tasks can be accomplished by using the command history feature? (Choose two.)"},{"item":"Set the command history buffer size."},{"item":"Recall previously entered commands."},{"item":"Explanation:"},{"item":"2. What is the first action in the boot sequence when a switch is powered on?"},{"item":"load a power-on self-test program"},{"item":"Explanation:"},{"item":"3. What must an administrator have in order to reset a lost password on a router?"},{"item":"physical access to the router"},{"item":"Explanation:"},{"item":"4. When configuring a switch for SSH access, what other command that is associated with the login local command is required to be entered on the switch?"},{"item":"username username secret secret"},{"item":"Explanation:"},{"item":"5. Which command displays information about the auto-MDIX setting for a specific interface?​"},{"item":"show controllers"},{"item":"Explanation:"},{"item":"6. If one end of an Ethernet connection is configured for full duplex and the other end of the connection is configured for half duplex, where would late collisions be observed?"},{"item":"on the half-duplex end of the connection"},{"item":"Explanation:"},{"item":"7. Which command is used to set the BOOT environment variable that defines where to find the IOS image file on a switch?"},{"item":"boot system"},{"item":"Explanation:"},{"item":"8. What does a switch use to locate and load the IOS image?"},{"item":"BOOT environment variable"},{"item":"Explanation:"},{"item":"9. Which protocol adds security to remote connections?"},{"item":"SSH"},{"item":"10. What is a characteristic of an IPv4 loopback interface on a Cisco IOS router?​"},{"item":"It is a logical interface internal to the router."},{"item":"11. What is the minimum Ethernet frame size that will not be discarded by the receiver as a runt frame?"},{"item":"64 bytes"},{"item":"Explanation:"},{"item":"12. After which step of the switch bootup sequence is the boot loader executed?"},{"item":"after POST execution"},{"item":"Explanation:"},{"item":"13. Which impact does adding a Layer 2 switch have on a network?"},{"item":"an increase in the size of the broadcast domain"},{"item":"Explanation:"},{"item":"14. Which characteristic describes cut-through switching?"},{"item":"Frames are forwarded without any error checking."},{"item":"Explanation:"},{"item":"15. What is the significant difference between a hub and a Layer 2 LAN switch?"},{"item":"A hub extends a collision domain, and a switch divides collision domains."},{"item":"Explanation:"},{"item":"16. Which statement is correct about Ethernet switch frame forwarding decisions?"},{"item":"Frame forwarding decisions are based on MAC address and port mappings in the CAM table."},{"item":"Explanation:"},{"item":"17. How do switch buffers affect network performance?"},{"item":"They store frames received, thus preventing premature frame discarding when network congestion occurs."},{"item":"Explanation:"},{"item":"18. Which switch characteristic helps keep traffic local and alleviates network congestion?"},{"item":"high port density"},{"item":"Explanation:"},{"item":"19. Which switch component reduces the amount of packet handling time inside the switch?"},{"item":"ASIC"},{"item":"Explanation:"},{"item":"20. Refer to the exhibit. A switch receives a Layer 2 frame that contains a source MAC address of 000b.a023.c501 and a destination MAC address of 0050.0fae.75aa. Place the switch steps in the order they occur. (Not all options are used.)"},{"item":"Explanation:"},{"item":"21. What information is added to the switch table from incoming frames?"},{"item":"source MAC address and incoming port number"},{"item":"Explanation:"},{"item":"22. Which switching method ensures that the incoming frame is error-free before forwarding?"},{"item":"store-and-forward"},{"item":"Explanation:"},{"item":"23. Refer to the exhibit. How many broadcast domains are displayed?"},{"item":"8"},{"item":"Explanation:"},{"item":"24. Under which two occasions should an administrator disable DTP while managing a local area network? (Choose two.)"},{"item":"when connecting a Cisco switch to a non-Cisco switch"},{"item":"on links that should not be trunking"},{"item":"Explanation:"},{"item":"25. Which two characteristics describe the native VLAN? (Choose two.)"},{"item":"The native VLAN traffic will be untagged across the trunk link."},{"item":"The native VLAN provides a common identifier to both ends of a trunk."},{"item":"Explanation:"},{"item":"26. On a switch that is configured with multiple VLANs, which command will remove only VLAN 100 from the switch?"},{"item":"Switch(config)# no vlan 100"},{"item":"Explanation:"},{"item":"27. Refer to the exhibit. A network administrator is reviewing port and VLAN assignments on switch S2 and notices that interfaces Gi0/1 and Gi0/2 are not included in the output. Why would the interfaces be missing from the output?"},{"item":"They are configured as trunk interfaces."},{"item":"Explanation:"},{"item":"28. A network contains multiple VLANs spanning multiple switches. What happens when a device in VLAN 20 sends a broadcast Ethernet frame?"},{"item":"Only devices in VLAN 20 see the frame."},{"item":"Explanation:"},{"item":"29. Refer to the exhibit. All workstations are configured correctly in VLAN 20. Workstations that are connected to switch SW1 are not able to send traffic to workstations on SW2. What could be done to remedy the problem?"},{"item":"Allow VLAN 20 on the trunk link."},{"item":"Explanation:"},{"item":"30. What happens to switch ports after the VLAN to which they are assigned is deleted?"},{"item":"The ports stop communicating with the attached devices."},{"item":"Explanation:"},{"item":"31. Match the IEEE 802.1Q standard VLAN tag field with the description. (Not all options are used.)"},{"item":"Explanation:"},{"item":"32. Refer to the exhibit. In what switch mode should port G0/1 be assigned if Cisco best practices are being used?"},{"item":"trunk"},{"item":"Explanation:"},{"item":"33. Match the DTP mode with its function. (Not all options are used.)"},{"item":"34. Port Fa0/11 on a switch is assigned to VLAN 30. If the command no switchport access vlan 30 is entered on the Fa0/11 interface, what will happen?"},{"item":"Port Fa0/11 will be returned to VLAN 1."},{"item":"Explanation:"},{"item":"35. Which command displays the encapsulation type, the voice VLAN ID, and the access mode VLAN for the Fa0/1 interface?"},{"item":"show interfaces Fa0/1 switchport"},{"item":"Explanation:"},{"item":"36. Refer to the exhibit. A technician is programming switch SW3 to manage voice and data traffic through port Fa0/20. What, if anything, is wrong with the configuration?"},{"item":"The command used to assign the voice VLAN to the switch port is incorrect."},{"item":"Explanation:"},{"item":"37. Which four steps are needed to configure a voice VLAN on a switch port? (Choose four)."},{"item":"Assign the voice VLAN to the switch port."},{"item":"Ensure that voice traffic is trusted and tagged with a CoS priority value."},{"item":"Add a voice VLAN."},{"item":"Configure the switch port in access mode."},{"item":"Explanation:"},{"item":"38. Refer to the exhibit. PC1 is unable to communicate with server 1. The network administrator issues the show interfaces trunk command to begin troubleshooting. What conclusion can be made based on the output of this command?"},{"item":"Interface G0/2 is not configured as a trunk."},{"item":"Explanation:"},{"item":"39. Refer to the exhibit. What is the cause of the error that is displayed in the configuration of inter-VLAN routing on router CiscoVille?"},{"item":"The encapsulation dot1Q 20 command has not been configured.​"},{"item":"40. Refer to the exhibit. A network administrator has configured router CiscoVille with the above commands to provide inter-VLAN routing. What command will be required on a switch that is connected to the Gi0/0 interface on router CiscoVille to allow inter-VLAN routing?​"},{"item":"switchport mode trunk"},{"item":"Explanation:"},{"item":"41. A high school uses VLAN15 for the laboratory network and VLAN30 for the faculty network. What is required to enable communication between these two VLANs while using the router-on-a-stick approach?"},{"item":"A switch with a port that is configured as a trunk is needed when connecting to the router."},{"item":"Explanation:"},{"item":"42. When routing a large number of VLANs, what are two disadvantages of using the router-on-a-stick inter-VLAN routing method rather than the multilayer switch inter-VLAN routing method? (Choose two.)"},{"item":"A dedicated router is required."},{"item":"Multiple subinterfaces may impact the traffic flow speed."},{"item":"Explanation:"},{"item":"43. Refer to the exhibit. A network administrator is verifying the configuration of inter-VLAN routing. Users complain that PCs on different VLANs cannot communicate. Based on the output, what are two configuration errors on switch interface Gi1/1? (Choose two.)"},{"item":"Gi1/1 is in the default VLAN."},{"item":"Gi1/1 is configured as trunk mode."},{"item":"44. Refer to the exhibit. A network administrator is verifying the configuration of inter-VLAN routing. Users complain that PC2 cannot communicate with PC1. Based on the output, what is the possible cause of the problem?"},{"item":"The encapsulation dot1Q 5 command contains the wrong VLAN."},{"item":"Explanation:"},{"item":"45. Refer to the exhibit. A network administrator has configured router CiscoVille with the above commands to provide inter-VLAN routing. What type of port will be required on a switch that is connected to Gi0/0 on router CiscoVille to allow inter-VLAN routing?"},{"item":"trunk port"},{"item":"Explanation:"},{"item":"46. Refer to the exhibit. A network administrator is configuring RT1 for inter-VLAN routing. The switch is configured correctly and is functional. Host1, Host2, and Host3 cannot communicate with each other. Based on the router configuration, what is causing the problem?"},{"item":"IP addresses on the subinterfaces are incorrectly matched to the VLANs."},{"item":"47. Refer to the exhibit. A router-on-a-stick configuration was implemented for VLANs 15, 30, and 45, according to the show running-config command output. PCs on VLAN 45 that are using the 172.16.45.0 /24 network are having trouble connecting to PCs on VLAN 30 in the 172.16.30.0 /24 network. Which error is most likely causing this problem?​"},{"item":"There is an incorrect IP address configured on GigabitEthernet 0/0.30."},{"item":"Explanation:"},{"item":"48. What is a characteristic of a routed port on a Layer 3 switch?"},{"item":"It is not assigned to a VLAN."},{"item":"Explanation:"},{"item":"49. Refer to the exhibit. A network administrator needs to configure router-on-a-stick for the networks that are shown. How many subinterfaces will have to be created on the router if each VLAN that is shown is to be routed and each VLAN has its own subinterface?"},{"item":"4"},{"item":"50. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw(config-if)# mdix auto command?"},{"item":"It automatically adjusts the port to allow device connections to use either a straight-through or a crossover cable."},{"item":"51. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw(config-if)# ip address 172.18.33.88 255.255.255.0 command?"},{"item":"It applies an IPv4 address to the virtual interface."},{"item":"52. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw# configure terminal command?"},{"item":"It enters the global configuration mode."},{"item":"53. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw# configure terminal command?"},{"item":"It enters the global configuration mode."},{"item":"54. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw(config-if)# shutdown command?"},{"item":"It disables a virtual or physical switch interface."},{"item":"55. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw(config-if)# shutdown command?"},{"item":"It disables a virtual or physical switch interface."},{"item":"56. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw(config-if)# ipv6 address 2001:db8:a2b4:88::1/64 command?"},{"item":"It applies an IPv6 address to the virtual interface."},{"item":"57. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw(config-if)# exit command?"},{"item":"It returns to global configuration mode."},{"item":"58. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw> enable command?"},{"item":"It enters privileged mode."},{"item":"58. A technician is configuring a new Cisco 2960 switch. What is the effect of issuing the BranchSw(config-if)# duplex full command?"},{"item":"It allows data to flow in both directions at the same time on the interface."},{"item":"60. What type of VLAN should not carry voice and network management traffic?"},{"item":"data VLAN"},{"item":"62. What type of VLAN is designed to reserve bandwidth to ensure IP Phone quality?"},{"item":"voice VLAN"},{"item":"63. What type of VLAN is initially the management VLAN?"},{"item":"default VLAN"},{"item":"64. What type of VLAN is designed to have a delay of less than 150 ms across the network?"},{"item":"voice VLAN"},{"item":"65. What type of VLAN is used to separate the network into groups of users or devices?"},{"item":"data VLAN"},{"item":"66. What type of VLAN is configured specifically for network traffic such as SSH, Telnet, HTTPS, HTTP, and SNMP?"},{"item":"management VLAN"},{"item":"68. What type of VLAN supports untagged traffic?"},{"item":"native VLAN"},{"item":"69. What type of VLAN supports untagged traffic?"},{"item":"native VLAN"},{"item":"70. Refer to the exhibit. A network administrator has configured R1 as shown. When the administrator checks the status of the serial interface, the interface is shown as being administratively down. What additional command must be entered on the serial interface of R1 to bring the interface up?"},{"item":"no shutdown"},{"item":"Explanation:"},{"item":"71. Refer to the exhibit. The network administrator wants to configure Switch1 to allow SSH connections and prohibit Telnet connections. How should the network administrator change the displayed configuration to satisfy the requirement?"},{"item":"Modify the transport input command."},{"item":"72. Which solution would help a college alleviate network congestion due to collisions?"},{"item":"a high port density switch"},{"item":"Explanation:"},{"item":"73. Which two statements are correct with respect to SVI inter-VLAN routing? (Choose two.)"},{"item":"Switching packets is faster with SVI."},{"item":"There is no need for a connection to a router."},{"item":"Explanation:"},{"item":"74. Refer to the exhibit. A network administrator is configuring inter-VLAN routing on a network. For now, only one VLAN is being used, but more will be added soon. What is the missing parameter that is shown as the highlighted question mark in the graphic?"},{"item":"It identifies the VLAN number."},{"item":"Explanation:"},{"item":"75. Which type of VLAN is used to designate which traffic is untagged when crossing a trunk port?"},{"item":"native"},{"item":"Explanation:"},{"item":"76. A network administrator issues the show vlan brief command while troubleshooting a user support ticket. What output will be displayed?"},{"item":"the VLAN assignment and membership for all switch ports"},{"item":"Explanation:"},{"item":"77. Open the PT Activity. Perform the tasks in the activity instructions and then answer the question."},{"item":"Which message is displayed when 10.10.10.1 is entered into the PC1 Web Browser address bar?"},{"item":"File Server"},{"item":"Explanation:"},{"item":"78. Match each DHCP message type with its description. (Not all options are used.)"},{"item":"Explanation:"},{"item":"79. What type of VLAN is configured specifically for network traffic such as SSH, Telnet, HTTPS, HHTP, and SNMP?"},{"item":"management VLAN"}]