[{"item":"How to find:"},{"item":"“Ctrl + F”"},{"item":"Questions Bank"},{"item":"NOTE: If you have the new question on this test, please comment Question and Multiple-Choice list in form below this article. We will update answers for you in the shortest time. Thank you! We truly value your contribution to the website."},{"item":"1. Which Layer 2 attack will result in legitimate users not getting valid IP addresses?"},{"item":"DHCP starvation"},{"item":"Explanation:"},{"item":"2. What mitigation plan is best for thwarting a DoS attack that is creating a MAC address table overflow?"},{"item":"Enable port security."},{"item":"Explanation:"},{"item":"3. Which three Cisco products focus on endpoint security solutions? (Choose three.)"},{"item":"Web Security Appliance"},{"item":"Email Security Appliance"},{"item":"NAC Appliance"},{"item":"Explanation:"},{"item":"4. True or False?"},{"item":"In the 802.1X standard, the client attempting to access the network is referred to as the supplicant."},{"item":"true"},{"item":"5. Which authentication method stores usernames and passwords in the router and is ideal for small networks?"},{"item":"local AAA"},{"item":"Explanation:"},{"item":"6. What represents a best practice concerning discovery protocols such as CDP and LLDP on network devices?"},{"item":"Disable both protocols on all interfaces where they are not required."},{"item":"Explanation:"},{"item":"7. Which protocol should be used to mitigate the vulnerability of using Telnet to remotely manage network devices?"},{"item":"SSH"},{"item":"Explanation:"},{"item":"8. Which statement describes the behavior of a switch when the MAC address table is full?"},{"item":"It treats frames as unknown unicast and floods all incoming frames to all ports within the local VLAN."},{"item":"Explanation:"},{"item":"9. What device is considered a supplicant during the 802.1X authentication process?"},{"item":"the client that is requesting authentication"},{"item":"Explanation:"},{"item":"10. Refer to the exhibit. Port Fa0/2 has already been configured appropriately. The IP phone and PC work properly. Which switch configuration would be most appropriate for port Fa0/2 if the network administrator has the following goals?"},{"item":"SWA(config-if)# switchport port-security"},{"item":"SWA(config-if)# switchport port-security maximum 2"},{"item":"SWA(config-if)# switchport port-security mac-address sticky"},{"item":"Explanation:"},{"item":"switchport port-security violation"},{"item":"switchport port-security"},{"item":"11. Refer to the exhibit. Port security has been configured on the Fa 0/12 interface of switch S1. What action will occur when PC1 is attached to switch S1 with the applied configuration?"},{"item":"Frames from PC1 will cause the interface to shut down immediately, and a log entry will be made."},{"item":"Explanation:"},{"item":"12. Which type of VLAN-hopping attack may be prevented by designating an unused VLAN as the native VLAN?"},{"item":"VLAN double-tagging"},{"item":"Explanation:"},{"item":"13. A network administrator is configuring DAI on a switch with the command ip arp inspection validate src-mac. What is the purpose of this configuration command?"},{"item":"It checks the source MAC address in the Ethernet header against the sender MAC address in the ARP body."},{"item":"Explanation:"},{"item":"Destination MAC"},{"item":"Source MAC"},{"item":"IP address"},{"item":"14. Which two commands can be used to enable BPDU guard on a switch? (Choose two.)"},{"item":"S1(config)# spanning-tree portfast bpduguard default"},{"item":"S1(config-if)# spanning-tree bpduguard enable"},{"item":"Explanation:"},{"item":"spanning-tree portfast bpduguard default"},{"item":"spanning-tree bpduguard enable"},{"item":"15. As part of the new security policy, all switches on the network are configured to automatically learn MAC addresses for each port. All running configurations are saved at the start and close of every business day. A severe thunderstorm causes an extended power outage several hours after the close of business. When the switches are brought back online, the dynamically learned MAC addresses are retained. Which port security configuration enabled this?"},{"item":"sticky secure MAC addresses"},{"item":"Explanation:"},{"item":"16. Which type of management frame may regularly be broadcast by an AP?"},{"item":"beacon"},{"item":"Explanation:"},{"item":"17. What are the two methods that are used by a wireless NIC to discover an AP? (Choose two.)"},{"item":"receiving a broadcast beacon frame"},{"item":"transmitting a probe request"},{"item":"Explanation:"},{"item":"18. A technician is configuring the channel on a wireless router to either 1, 6, or 11. What is the purpose of adjusting the channel?"},{"item":"to avoid interference from nearby wireless devices"},{"item":"Explanation:"},{"item":"19. While attending a conference, participants are using laptops for network connectivity. When a guest speaker attempts to connect to the network, the laptop fails to display any available wireless networks. The access point must be operating in which mode?"},{"item":"active"},{"item":"Explanation:"},{"item":"20. A network administrator is required to upgrade wireless access to end users in a building. To provide data rates up to 1.3 Gb/s and still be backward compatible with older devices, which wireless standard should be implemented?"},{"item":"802.11ac"},{"item":"Explanation:"},{"item":"21. A technician is about to install and configure a wireless network at a small branch office. What is the first security measure the technician should apply immediately upon powering up the wireless router?"},{"item":"Change the default user-name and password of the wireless router."},{"item":"Explanation:"},{"item":"22. On a Cisco 3504 WLC dashboard, which option provides access to the full menu of features?"},{"item":"Advanced"},{"item":"Explanation:"},{"item":"Advanced"},{"item":"Summary"},{"item":"23. Which step is required before creating a new WLAN on a Cisco 3500 series WLC?"},{"item":"Create a new VLAN interface."},{"item":"Explanation:"},{"item":"24. A network engineer is troubleshooting a newly deployed wireless network that is using the latest 802.11 standards. When users access high bandwidth services such as streaming video, the wireless network performance is poor. To improve performance the network engineer decides to configure a 5 Ghz frequency band SSID and train users to use that SSID for streaming media services. Why might this solution improve the wireless network performance for that type of service?"},{"item":"The 5 GHz band has more channels and is less crowded than the 2.4 GHz band, which makes it more suited to streaming multimedia."},{"item":"Explanation:"},{"item":"25. A network administrator is configuring a RADIUS server connection on a Cisco 3500 series WLC. The configuration requires a shared secret password. What is the purpose for the shared secret password?"},{"item":"It is used to encrypt the messages between the WLC and the RADIUS server."},{"item":"Explanation:"},{"item":"26. Which three parameters would need to be changed if best practices are being implemented for a home wireless AP? (Choose three.)"},{"item":"wireless network password"},{"item":"AP password"},{"item":"SSID"},{"item":"Explanation:"},{"item":"27. Which access control component, implementation, or protocol is based upon usernames and passwords?"},{"item":"authentication"},{"item":"28. Which type of wireless network is based on the 802.11 standard and a 2.4-GHz or 5-GHz radio frequency?"},{"item":"wireless local-area network"},{"item":"29. Which two Cisco solutions help prevent DHCP starvation attacks? (Choose two.)"},{"item":"DHCP Snooping"},{"item":"Port Security"},{"item":"Explanation:"},{"item":"30. What are three techniques for mitigating VLAN attacks? (Choose three.)"},{"item":"Enable trunking manually."},{"item":"Disable DTP."},{"item":"Set the native VLAN to an unused VLAN."},{"item":"Explanation:"},{"item":"31. Refer to the exhibit. What can be determined about port security from the information that is shown?"},{"item":"The port violation mode is the default for any port that has port security enabled."},{"item":"Explanation:"},{"item":"32. A network administrator of a college is configuring the WLAN user authentication process. Wireless users are required to enter username and password credentials that will be verified by a server. Which server would provide such service?"},{"item":"RADIUS"},{"item":"Explanation:"},{"item":"33. A technician is troubleshooting a slow WLAN that consists of 802.11b and 802.11g devices . A new 802.11n/ac dual-band router has been deployed on the network to replace the old 802.11g router. What can the technician do to address the slow wireless speed?"},{"item":"Split the wireless traffic between the 802.11n 2.4 GHz band and the 5 GHz band."},{"item":"Explanation:"},{"item":"34. The company handbook states that employees cannot have microwave ovens in their offices. Instead, all employees must use the microwave ovens located in the employee cafeteria. What wireless security risk is the company trying to avoid?"},{"item":"accidental interference"},{"item":"Explanation:"},{"item":"35. What is the function provided by CAPWAP protocol in a corporate wireless network?"},{"item":"CAPWAP provides the encapsulation and forwarding of wireless user traffic between an access point and a wireless LAN controller."},{"item":"Explanation:"},{"item":"36. Open the PT Activity. Perform the tasks in the activity instructions and then answer the question."},{"item":"Which event will take place if there is a port security violation on switch S1 interface Fa0/1?"},{"item":"Packets with unknown source addresses will be dropped."},{"item":"Explanation:"},{"item":"show port-security interface"},{"item":"37. Match each functional component of AAA with its description. (Not all options are used.)"},{"item":"38. What are two protocols that are used by AAA to authenticate users against a central database of usernames and password? (Choose two.)"},{"item":"TACACS+"},{"item":"RADIUS"},{"item":"Explanation:"},{"item":"39. What is the result of a DHCP starvation attack?"},{"item":"Legitimate clients are unable to lease IP addresses."},{"item":"Explanation:"},{"item":"40. Which feature or configuration on a switch makes it vulnerable to VLAN double-tagging attacks?"},{"item":"the native VLAN of the trunking port being the same as a user VLAN"},{"item":"Explanation:"},{"item":"41. Which component of AAA allows an administrator to track individuals who access network resources and any changes that are made to those resources?"},{"item":"accounting"},{"item":"Explanation:"},{"item":"42. Refer to the exhibit. PC1 and PC2 should be able to obtain IP address assignments from the DHCP server. How many ports among switches should be assigned as trusted ports as part of the DHCP snooping configuration?"},{"item":"7"},{"item":"Explanation:"},{"item":"43. An IT security specialist enables port security on a switch port of a Cisco switch. What is the default violation mode in use until the switch port is configured to use a different violation mode?"},{"item":"shutdown"},{"item":"Explanation:"},{"item":"44. A laptop cannot connect to a wireless access point. Which two troubleshooting steps should be taken first? (Choose two.)"},{"item":"Ensure that the wireless NIC is enabled."},{"item":"Ensure that the wireless SSID is chosen."},{"item":"Explanation:"},{"item":"45. What is an advantage of SSID cloaking?​"},{"item":"Clients will have to manually identify the SSID to connect to the network.​"},{"item":"Explanation:"},{"item":"46. What is a wireless security mode that requires a RADIUS server to authenticate wireless users?"},{"item":"enterprise"},{"item":"Explanation:"},{"item":"47. A company has recently implemented an 802.11n wireless network. Some users are complaining that the wireless network is too slow. Which solution is the best method to enhance the performance of the wireless network?"},{"item":"Split the traffic between the 2.4 GHz and 5 GHz frequency bands."},{"item":"Explanation:"},{"item":"48. Which protocol can be used to monitor the network?"},{"item":"SNMP"},{"item":"Explanation:"},{"item":"49. A network administrator deploys a wireless router in a small law firm. Employee laptops join the WLAN and receive IP addresses in the 10.0.10.0/24 network. Which service is used on the wireless router to allow the employee laptops to access the internet?"},{"item":"NAT"},{"item":"Explanation:"},{"item":"50. Which service can be used on a wireless router to prioritize network traffic among different types of applications so that voice and video data are prioritized over email and web data?"},{"item":"QoS"},{"item":"Explanation:"},{"item":"51. Which access control component, implementation, or protocol is based on device roles of supplicant, authenticator, and authentication server?"},{"item":"802.1X"},{"item":"52. Which type of wireless network is suitable for national and global communications?"},{"item":"wireless wide-area network"},{"item":"53. Which feature on a switch makes it vulnerable to VLAN hopping attacks?"},{"item":"the automatic trunking port feature enabled for all ports by default"},{"item":"Explanation:"},{"item":"54. Which component of AAA is used to determine which resources a user can access and which operations the user is allowed to perform?"},{"item":"authorization"},{"item":"Explanation:"},{"item":"55. Refer to the exhibit. The Fa0/2 interface on switch S1 has been configured with the switchport port-security mac-address 0023.189d.6456 command and a workstation has been connected. What could be the reason that the Fa0/2 interface is shutdown?"},{"item":"The MAC address of PC1 that connects to the Fa0/2 interface is not the configured MAC address."},{"item":"Explanation:"},{"item":"56. A network administrator enters the following commands on the switch SW1."},{"item":"What is the effect after these commands are entered?"},{"item":"FastEthernet ports 5 through 10 can receive up to 6 DHCP discovery messages per second."},{"item":"Explanation:"},{"item":"57. A network administrator is configuring port security on a Cisco switch. The company security policy specifies that when a violation occurs, packets with unknown source addresses should be dropped and no notification should be sent. Which violation mode should be configured on the interfaces?"},{"item":"protect"},{"item":"Explain:"},{"item":"58. A network administrator is working to improve WLAN performance on a dual-band wireless router. What is a simple way to achieve a split-the-traffic result?"},{"item":"Make sure that different SSIDs are used for the 2.4 GHz and 5 GHz bands."},{"item":"Explanation:"},{"item":"59. Which access control component, implementation, or protocol controls what users can do on the network?"},{"item":"authorization"},{"item":"60. Which type of wireless network is suitable for providing wireless access to a city or district?"},{"item":"wireless metropolitan-area network"},{"item":"61. On a Cisco 3504 WLC Summary page ( Advanced > Summary ), which tab allows a network administrator to access and configure a WLAN for a specific security option such as WPA2?"},{"item":"WLANs"},{"item":"62. What type of wireless antenna is best suited for providing coverage in large open spaces, such as hallways or large conference rooms?"},{"item":"omnidirectional"},{"item":"64. What security benefit is gained from enabling BPDU guard on PortFast enabled interfaces?"},{"item":"preventing rogue switches from being added to the network"},{"item":"Explanation:"},{"item":"65. Which access control component, implementation, or protocol logs EXEC and configuration commands configured by a user?"},{"item":"accounting"},{"item":"66. Which type of wireless network uses transmitters to provide coverage over an extensive geographic area?"},{"item":"wireless wide-area network"},{"item":"67. Which access control component, implementation, or protocol controls who is permitted to access a network?"},{"item":"authentication"},{"item":"68. What two IEEE 802.11 wireless standards operate only in the 5 GHz range? (Choose two.)"},{"item":"802.11ac"},{"item":"802.11a"},{"item":"Explanation:"},{"item":"69. Which type of wireless network uses low powered transmitters for a short-range network, usually 20 to 30 ft. (6 to 9 meters)?"},{"item":"wireless personal-area network"},{"item":"71. Which wireless network topology would be used by network engineers to provide a wireless network for an entire college building?"},{"item":"infrastructure"},{"item":"72. Which type of wireless network uses transmitters to provide wireless service over a large urban region?"},{"item":"wireless metropolitan-area network"},{"item":"73. Which type of wireless network is suitable for use in a home or office?"},{"item":"wireless local-area network"},{"item":"74. Which access control component, implementation, or protocol indicates success or failure of a client-requested service with a PASS or FAIL message?"},{"item":"authorization"},{"item":"75. Which type of wireless network often makes use of devices mounted on buildings?"},{"item":"wireless metropolitan-area network"},{"item":"76. A network administrator is configuring DAI on a switch with the command ip arp inspection validate src-mac . What is the purpose of this configuration command?"},{"item":"It checks the source MAC address in the Ethernet header against the sender MAC address in the ARP body."},{"item":"77. Which access control component, implementation, or protocol collects and reports usage data?"},{"item":"accounting"},{"item":"78. Which type of wireless network uses transmitters to cover a medium-sized network, usually up to 300 feet (91.4 meters)?"},{"item":"Wireless LANs (WLAN)"},{"item":"Accounting"},{"item":"Explanation:"},{"item":"wireless personal-area network"},{"item":"authentication"},{"item":"82. A technician is troubleshooting a slow WLAN and decides to use the split-the-traffic approach. Which two parameters would have to be configured to do this? (Choose two.)"},{"item":"Configure the 5 GHz band for streaming multimedia and time sensitive traffic."},{"item":"Configure the 2.4 GHz band for basic internet traffic that is not time sensitive."},{"item":"83. Which access control component, implementation, or protocol restricts LAN access through publicly accessible switch ports?"},{"item":"802.1X"},{"item":"84. A network administrator is required to upgrade wireless access to end users in a building. To provide data rates up to 1.3Gb/s and still be backward compatible with older devices, which wireless standard should be implemented?"}]